app/User.php

select * from `user_roles` where `user_id` = '1' limit 1
---
    public function isHR()
    {
        $userId = Auth::user()->id;
        $userRole = UserRole::where('user_id', $userId)->first();

select * from `user_roles` where `user_id` = '1' limit 1
---
    public function notAnalyst()
    {
        $userId = Auth::user()->id;
        $userRole = UserRole::where('user_id', $userId)->first();

select * from `user_roles` where `user_id` = '1' limit 1
---
    public function isCoordinator()
    {
        $userId = Auth::user()->id;
        $userRole = UserRole::where('user_id', $userId)->first();