app/Http/Controllers/AttendanceController.php

select count(*) as aggregate from `attendance_filenames`
---
    public function importAttendanceFile()
    {
      $files = AttendanceFilename::paginate(10);

select count(*) as aggregate from `attendance_managers`
---
    public function showSheetDetails()
    {
      $column = '';
      $string = '';
      $dateFrom = '';
      $dateTo = '';
      $attendances = AttendanceManager::paginate(20);