app/Http/Controllers/AuthController.php

        public function doLogin(Request $request)
        {
            $email    = $request->email;
            $password = $request->password;

            $user = User::where('email', $email)->first();
---
select * from `users` where `email` = 'email@gmail.com' limit 1