app/Http/Controllers/EmpController.php

select * from `employees` where `employees`.`user_id` in ('1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15')
select * from `user_roles` where `user_roles`.`user_id` in ('1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '13', '14', '15')
select * from `users` limit 15 offset 0
select count(*) as aggregate from `users`
---
    public function showEmployee()
    {
        $emps   = User::with('employee', 'role.role')->paginate(15);

select * from `employees` where `employees`.`user_id` in ('3')
select * from `user_roles` where `user_roles`.`user_id` in ('3')
select * from `users` where `id` = '3' limit 1
select * from `roles`
---
    public function showEdit($id)
    {
        //$emps = Employee::whereid($id)->with('userrole.role')->first();
        $emps = User::where('id', $id)->with('employee', 'role.role')->first();

        $roles = Role::get();

select * from `employees` where `id` = '3' limit 1
---
    public function doEdit(Request $request, $id)
    {
        $filename = public_path('img/avatar.png');
        if ($request->file('photo')) {
            $file             = $request->file('photo');
            $filename         = str_random(12);
            $fileExt          = $file->getClientOriginalExtension();
            $allowedExtension = ['jpg', 'jpeg', 'png'];
            $destinationPath  = public_path('photos');
            if (!in_array($fileExt, $allowedExtension)) {
                return redirect()->back()->with('message', 'Extension not allowed');
            }
            $filename = $filename . '.' . $fileExt;
            $file->move($destinationPath, $filename);
        }

        //$edit = Employee::findOrFail($id);
        $edit = Employee::where('id', $id)->first();

select * from `user_roles` where (`user_id` = '3') limit 1
---
        $request->session()->flash('success', 'Employee updated successfully!');

        // Update the user role
        $user_roles = UserRole::firstOrNew(['user_id' => $id]);