app/Http/Controllers/EmpController.php

select * from `employees` where `user_id` = '2' limit 1
---
        $full_final        = $request->full_final;

        //$edit = Employee::findOrFail($id);
        $edit = Employee::where('user_id', $id)->first();

select * from `user_roles` where (`user_id` = '2') limit 1
update `user_roles` set `role_id` = '14', `updated_at` = '2019-02-08 23:07:09' where `id` = '6'
---
        $edit->save();

        // Update the user role
        $user_roles = UserRole::firstOrNew(['user_id' => $id]);
        $user_roles->role_id = $request->role;
        $user_roles->save();

insert into `users` (`name`, `email`, `password`, `updated_at`, `created_at`) values ('Teresita Vercide', 'teresita@gravitybpo.com', 'y$tXF59ErXIow0g6Tb2S9YMuSRASWDZuAvQgNxwhiUPpiUzKCtN0g5q', '2019-02-13 23:08:26', '2019-02-13 23:08:26')
---
    public function uploadFile(Request $request)
    {
        $files = Input::file('upload_file');

        /* try {*/
        foreach ($files as $file) {
            Excel::load($file, function ($reader) {
                $rows = $reader->get(['emp_name', 'emp_code', 'emp_status', 'role', 'gender', 'dob', 'doj', 'mob_number', 'qualification', 'emer_number', 'pan_number', 'father_name', 'address', 'permanent_address', 'formalities', 'offer_acceptance', 'prob_period', 'doc', 'department', 'salary', 'account_number', 'bank_name', 'ifsc_code', 'pf_account_number', 'un_number', 'pf_status', 'dor', 'notice_period', 'last_working_day', 'full_final']);

                foreach ($rows as $row) {
\Log::info($row->role);
                    $user           = new User;
                    $user->name     = $row->emp_name;
                    $user->email    = str_replace(' ', '_', $row->emp_name) . '@sipi-ip.sg';
                    $user->password = bcrypt('123456');
                    $user->save();