app/Http/Controllers/LeaveController.php

select * from `employee_leaves` where `user_id` = '1' limit 15 offset 0
select count(*) as aggregate from `employee_leaves` where `user_id` = '1'
---
    public function showMyLeave()
    {

      $leaves = EmployeeLeaves::where('user_id', \Auth::user()->id)->paginate(15);

select * from `employee_leaves` limit 15 offset 0
select * from `employees` where `employees`.`user_id` in ('1')
select * from `users` where `users`.`id` in ('1')
select count(*) as aggregate from `employee_leaves`
---
    public function showAllLeave()
    {
      if(!\Auth::user()->isHR())
      {
        $leaves = EmployeeLeaves::with('user.employee')->where('tl_id', \Auth::user()->id)->orWhere('manager_id', \Auth::user()->id)->paginate(15);
      }
      else
      {
        $leaves = EmployeeLeaves::with('user.employee')->paginate(15);