app/Http/Controllers/ProfileController.php

    public function show(){

        $details = Employee::where('user_id', \Auth::user()->id)->with('userrole.role')->first();
        $events = $this->convertToArray(Event::where('date', '>', Carbon::now())->orderBy('date','desc')->take(3)->get());
---
select * from `employees` where `user_id` = '1' limit 1
select * from `user_roles` where `user_roles`.`user_id` in ('1')
select * from `events` where `date` > '2019-02-08 02:26:40' order by `date` desc limit 3